frontend/controllers/OrderController.php

SELECT * FROM `order` WHERE `data` > '2017-02-24'
---
    public function actionIndex() {
        $date = date('Y-m-d');
        $sort = new Sort([
            'attributes' => [

                'restaurant' => [
                    'asc' => ['restaurantId' => SORT_ASC],
                    'desc' => ['restaurantId' => SORT_DESC],
                    'default' => SORT_DESC,
                    'label' => 'Restauracji',
                ],
            ],
        ]);


        $model = new Order();
        $model = Order::find()
                ->where(['>', 'data', $date])
                ->orderBy($sort->orders)
                ->all();

SELECT * FROM `restaurants` WHERE `id`='3'
SELECT * FROM `imagesmenu` WHERE `restaurantId`='3'
---
    public function actionRestaurant($id) {
        $date = date('Y-m-d');
        $resturant = new Restaurants;
        $restaurant = Restaurants::findOne($id);
        $imagesMenu = Imagesmenu::find()->where(['restaurantId' => $id])->all();

SELECT * FROM `order` WHERE (`restaurantId`='3') AND (`data` > '2017-02-24')
---
    public function actionOrderCompleted($id) {
        $date = date('Y-m-d');

        $model = Order::find()->where(['restaurantId'=>$id])->andWhere(['>', 'data', $date])->all();