frontend/controllers/SiteController.php

    public function actionIndex($id = 0)
    {

        if ($id > 0) {           //tu trzeba dać && nie więcej niż ostatni rekord w bazie
            $query = Restaurants::find()->where(['categoryId' => $id]);
            $pagination = new Pagination([
                'defaultPageSize' => 10,
                'totalCount' => $query->count(),]);
            $restaurants = $query->orderBy('restaurantName')
                    ->offset($pagination->offset)
                    ->limit($pagination->limit)
                    ->all();
            //$restaurants = $category->restaurants;
        } else {
            //$restaurants = Restaurants::find()->all();
            $query = Restaurants::find();
            $pagination = new Pagination([
                'defaultPageSize' => 20,
                'totalCount' => $query->count(),]);
            $restaurants = $query->orderBy('restaurantName')
                    ->offset($pagination->offset)
                    ->limit($pagination->limit)
                    ->all();
        }

        $categorys = Category::find()->all();
---
SELECT COUNT(*) FROM `restaurants` WHERE `categoryId`='5'
SELECT * FROM `restaurants` WHERE `categoryId`='5' ORDER BY `restaurantName` LIMIT 10
SELECT COUNT(*) FROM `restaurants`
SELECT * FROM `restaurants` ORDER BY `restaurantName` LIMIT 10
SELECT * FROM `category`

    public function actionRestaurant($id)
    {

        $restaurant = Restaurants::findOne($id);
        $imagesMenu = Imagesmenu::find()->where(['restaurantId' => $id])->all();
        //$menu = Restaurants::findOne($id);
        $menu = $restaurant->menu;
        $restaurants = Restaurants::find()->all();
        $model = new Imagesmenu();
        $dataProvider = new ActiveDataProvider([
            'query' => Menu::find()->where(['restaurantId' => $id]),
            'pagination' => [
                'pageSize' => 20,
            ],
        ]);
---
SELECT * FROM `imagesmenu` WHERE `restaurantId`='2'
SELECT * FROM `restaurants` WHERE `id`='2'
SELECT * FROM `menu` WHERE `restaurantId`=2

    protected function findModel($id)
    {
        if (($model = Menu::findOne($id)) !== null) {
---
SELECT * FROM `menu` WHERE `id`='5'

    public function actionUpdate($id)
    {

        $model = $this->findModel($id);

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
            return $this->redirect(['view', 'id' => $model->id]);
        } else {
            $menu = Menu::findOne($id);
---
SELECT * FROM `menu` WHERE `id`='5'