frontend/models/SignupForm.php

INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('test1', 'masmfm@masfk.pl', '$2y$13$jLu2HIU7vpKjt14oQuvuVevLieaBMM3nKKzNpQJ/TIHoEZZxsONgO', 'SS7D0ampMB4OJUXq-eu6XbhGUnSJJ2OS', 10, 1488453384, 1488453384)
---
    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();

        return $user->save() ? $user : null;